# ToposolidFunctionParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ToposolidFunctionParam Property
ParameterTypeId Class See Also
---
"Function"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ToposolidFunctionParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ToposolidFunctionParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ToposolidFunctionParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace